Revit 2024 API
NonContinuousRailStructure Methods
The NonContinuousRailStructure type exposes the following members.
Methods
Name | Description
AddNonContinuousRail
 Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetNonContinuousRail
 Gets the Non-Continuous Rail object of specified index from the Rail Structure.
GetNonContinuousRailCount
 Gets number of Non-Continuous Rails.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidNonContinuousRailProfile
 Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
RemoveNonContinuousRail
 Removes Non-Continuous Rail from the Rail Structure.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace